## TCT Day 4 - Pandas cont'

* Row and column operations
    - rename column 
    - drop column 
    - inplace
    - sort
    - math operations
    - apply
* Group by

In [86]:
import pandas as pd
import numpy as np

In [87]:
#create a series
series1=pd.Series([1,2,3,4,5])

In [88]:
#convert series to dataframe, give the column a custom name
df=pd.DataFrame(series1,columns=['One'])

In [89]:
df

   One
0    1
1    2
2    3
3    4
4    5

**Rename Column**

In [90]:
#rename the column 
df.rename(columns={'One':'Column'},inplace=True)

In [91]:
df

   Column
0       1
1       2
2       3
3       4
4       5

In [93]:
#convert series to dataframe wihtout specifying column name 
df1=pd.DataFrame(series1)

In [94]:
#rename the column 
df1.rename(columns={0:'Column'})

   Column
0       1
1       2
2       3
3       4
4       5

**Drop Column**

In [95]:
#drop the column 
df1.drop(columns={0},inplace=True)

In [96]:
df1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [97]:
#drop entire dataframe
del df1

In [98]:
df1

NameError: name 'df1' is not defined

In [101]:
#convert series to dataframe wihtout specifying column name 
df2=pd.DataFrame(series1)
df2

   0
0  1
1  2
2  3
3  4
4  5

**inplace**

If inplace=True is passed in a pandas function, the application is returned to the dataframe and saved. Therefore the dataframe changes have been saved. You don't need to assign a new dataframe to the change.

The dafault setting is False, meaning if you don't assign a new dataframe on the step you apply the function, your changes are not saved for the next executable line.

In [102]:
#drop column using axis
df2.drop([0],axis=1,inplace=True)

In [103]:
df2

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [104]:
del df2

In [107]:
#create a matrix 5x5 with randon numbers, custom label all columns 
df3 = pd.DataFrame(np.random.randn(5,5),columns=['One','Two','Three','Four','Five'])

In [108]:
df3

        One       Two     Three      Four      Five
0  0.986118  0.274728  0.103965  1.599914 -0.177736
1  0.601669  1.118193 -1.129709 -0.396420  0.095995
2  0.714110  0.437615  1.183711  0.208399 -0.984456
3  1.661097  1.236294 -0.536210  0.701689 -0.881434
4 -0.346728 -1.486016  0.276715  0.899385 -0.242986

**Sort Columns**

In [110]:
#sort columns by one of more columns, use ascending False for descending order 
df3.sort_values(by=['One','Two'],ascending=False,inplace=True)

In [111]:
df3

        One       Two     Three      Four      Five
3  1.661097  1.236294 -0.536210  0.701689 -0.881434
0  0.986118  0.274728  0.103965  1.599914 -0.177736
2  0.714110  0.437615  1.183711  0.208399 -0.984456
1  0.601669  1.118193 -1.129709 -0.396420  0.095995
4 -0.346728 -1.486016  0.276715  0.899385 -0.242986

**Basic Math Operations in Column**

In [113]:
#calculcate mean for all columns in df3
df3.mean()

One      0.723253
Two      0.316163
Three   -0.020305
Four     0.602593
Five    -0.438124
dtype: float64

In [115]:
#calculcate sum for all columns in df3
df3.sum()

One      3.616267
Two      1.580814
Three   -0.101527
Four     3.012967
Five    -2.190618
dtype: float64

In [116]:
#count number of values in all columns in df3
df3.count()

One      5
Two      5
Three    5
Four     5
Five     5
dtype: int64

In [117]:
#calculcate min for all columns in df3
df3.min()

One     -0.346728
Two     -1.486016
Three   -1.129709
Four    -0.396420
Five    -0.984456
dtype: float64

In [118]:
#calculcate max for a specific column in df3
df3.iloc[:,0].max()

1.6610973660808481

**Exercise, apply()**

In [119]:
#create one function that multuplies all values of a column in df3 with 0.5

In [121]:
def function(s):
    return s*0.5

In [122]:
df3['One'].apply(function)

3    0.830549
0    0.493059
2    0.357055
1    0.300835
4   -0.173364
Name: One, dtype: float64

In [123]:
#get the number of elements in all columns in df3 usung apply()
df3.apply(len)

One      5
Two      5
Three    5
Four     5
Five     5
dtype: int64

In [124]:
df3

        One       Two     Three      Four      Five
3  1.661097  1.236294 -0.536210  0.701689 -0.881434
0  0.986118  0.274728  0.103965  1.599914 -0.177736
2  0.714110  0.437615  1.183711  0.208399 -0.984456
1  0.601669  1.118193 -1.129709 -0.396420  0.095995
4 -0.346728 -1.486016  0.276715  0.899385 -0.242986

**Group by**

In [125]:
#create new column as a category
df3['Category']=['Cat1','Cat1','Cat2','Cat1','Cat2']

In [126]:
df3

        One       Two     Three      Four      Five Category
3  1.661097  1.236294 -0.536210  0.701689 -0.881434     Cat1
0  0.986118  0.274728  0.103965  1.599914 -0.177736     Cat1
2  0.714110  0.437615  1.183711  0.208399 -0.984456     Cat2
1  0.601669  1.118193 -1.129709 -0.396420  0.095995     Cat1
4 -0.346728 -1.486016  0.276715  0.899385 -0.242986     Cat2

In [133]:
#group by sum function on Category column for all columns in df3
df4=df3.groupby('Category').sum()

In [134]:
df4

               One       Two     Three      Four      Five
Category
Cat1      3.248885  2.629215 -1.561953  1.905183 -0.963176
Cat2      0.367382 -1.048401  1.460426  1.107784 -1.227442

In [135]:
#group by many aggregations functions on Category column on for column One
df4=df3.groupby('Category')['One'].agg(['sum','count','mean'])

In [136]:
df4

               sum  count      mean
Category
Cat1      3.248885      3  1.082962
Cat2      0.367382      2  0.183691

In [147]:
#rename aggregation function on a column
df4=df3.groupby("Category").agg({'One': [('new column name', 'sum')]})

In [148]:
df4

                     One
         new column name
Category
Cat1            3.248885
Cat2            0.367382

In [137]:
#get aggregation frunction from describe()
df4=df3.groupby('Category')['One'].describe()['count']

In [138]:
df4

Category
Cat1    3.0
Cat2    2.0
Name: count, dtype: float64

In [141]:
df4=df3.groupby('Category')['One'].sum()

In [142]:
df4

Category
Cat1    3.248885
Cat2    0.367382
Name: One, dtype: float64